Documents/ФССП_ЗагрузкаИсполнительногоПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ФССП_ЗагрузкаИсполнительногоПроизводства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФССП_СостояниеИП</xr:Item>
				<xr:Item>AccumulationRegister.ФССП_ЗадолженностьПоИП</xr:Item>
				<xr:Item>AccumulationRegister.ФССП_ЗадолженностьПоПредметамИП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>task</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>тчИсполнительныеПроизводства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>exe_production</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>details</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>subject</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ip_end</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>bailiff</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>department</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтделСудебныхПриставов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_СлужбыСудебныхПриставов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СудебныйПриставИсполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОкончания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предмет5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозбуждения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИД</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганВыдавшийИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФССП_ТипыИсполнительныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ФССП_ЗадолженностьПоПредметамИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ФССП_ЗадолженностьПоПредметамИП</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФССП_ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПлатеж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсполнительноеПроизводство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ФССП_ВидДвиженияЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФССП_ВидДвиженияЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отзвано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФССП_СтатусыИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ФССП_СтатусыИП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действующее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОконченоИсполнением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОконченоБезИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утерян</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтзывИД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ФССП_ЗагрузкаИсполнительногоПроизводства/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийИП,МассивСуммИПредметов,ТаблицаДвиженийЗадолженность) Экспорт
	Если МассивСуммИПредметов.количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ТаблицаСуммИПредметов = ОбъектыСервер.ПреобразоватьМассивВТаблицуЗначений(МассивСуммИПредметов);   
	
	ТаблицаСуммИПредметов = объектыСервер.ТипизированнаяТаблицаЗначений(ТаблицаСуммИПредметов);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Таблица.ИП КАК ID,
	                      |	Таблица.СтатусИП КАК Статус
	                      |ПОМЕСТИТЬ ТаблицаДвижений
	                      |ИЗ
	                      |	&Таблица КАК Таблица
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ID
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(Предметы.ИП КАК Справочник.ФССП_ИсполнительноеПроизводство) КАК ИсполнительноеПроизводство,
	                      |	ВЫРАЗИТЬ(Предметы.Предмет КАК Справочник.ФССП_ПредметыИП) КАК Предмет,
	                      |	ВЫРАЗИТЬ(Предметы.Сумма КАК ЧИСЛО(10, 2)) КАК Сумма
	                      |ПОМЕСТИТЬ Предметы
	                      |ИЗ
	                      |	&Предметы КАК Предметы
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	ИсполнительноеПроизводство,
	                      |	Предмет
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаДвижений.ID КАК ИсполнительноеПроизводство,
	                      |	ТаблицаДвижений.Статус КАК Статус,
	                      |	ФССП_ЗадолженностьПоПредметамИПОстатки.СуммаОстаток КАК СуммаОстаток,
	                      |	Предметы.Сумма КАК СуммаДокумент,
	                      |	ЕСТЬNULL(Предметы.Сумма, 0) - ЕСТЬNULL(ФССП_ЗадолженностьПоПредметамИПОстатки.СуммаОстаток, 0) КАК Сумма,
	                      |	Предметы.Предмет КАК Предмет
	                      |ПОМЕСТИТЬ ДвиженияЗадолженность
	                      |ИЗ
	                      |	Предметы КАК Предметы
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФССП_ЗадолженностьПоПредметамИП.Остатки(&МоментДО) КАК ФССП_ЗадолженностьПоПредметамИПОстатки
	                      |		ПО Предметы.ИсполнительноеПроизводство = ФССП_ЗадолженностьПоПредметамИПОстатки.ИсполнительноеПроизводство
	                      |			И Предметы.Предмет = ФССП_ЗадолженностьПоПредметамИПОстатки.Предмет
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДвижений КАК ТаблицаДвижений
	                      |		ПО Предметы.ИсполнительноеПроизводство = ТаблицаДвижений.ID
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	&Период КАК Период,
	                      |	ДвиженияЗадолженность.ИсполнительноеПроизводство КАК ИсполнительноеПроизводство,
	                      |	&Ссылка КАК Регистратор,
	                      |	ВЫБОР
	                      |		КОГДА ДвиженияЗадолженность.Сумма > 0
	                      |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                      |	КОНЕЦ КАК ВидДвижения,
	                      |	ВЫБОР
	                      |		КОГДА ДвиженияЗадолженность.Статус = &БезИсполнения
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК НеПлатеж,
	                      |	ВЫБОР
	                      |		КОГДА ДвиженияЗадолженность.Сумма > 0
	                      |			ТОГДА ДвиженияЗадолженность.Сумма
	                      |		ИНАЧЕ -ДвиженияЗадолженность.Сумма
	                      |	КОНЕЦ КАК Сумма,
	                      |	ВЫБОР
	                      |		КОГДА ДвиженияЗадолженность.Сумма > 0
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ФССП_ВидДвиженияЗадолженности.Начисление)
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ФССП_ВидДвиженияЗадолженности.Списание)
	                      |	КОНЕЦ КАК ВидДвиженияЗадолженности,
	                      |	ДвиженияЗадолженность.Предмет КАК Предмет
	                      |ИЗ
	                      |	ДвиженияЗадолженность КАК ДвиженияЗадолженность
	                      |ГДЕ
	                      |	ДвиженияЗадолженность.Сумма <> 0");
	
    Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("МоментДо", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Таблица", ТаблицаДвиженийИП); 
	Запрос.УстановитьПараметр("Предметы", ТаблицаСуммИПредметов);
	Запрос.УстановитьПараметр("БезИсполнения",Перечисления.ФССП_СтатусыИП.ОконченоБезИсполнения);
		
	ТаблицаДвиженийЗадолженность = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры 

процедура СтарыйОбработчик()
		//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	Таблица.ИП КАК ID,
	//                      |	Таблица.Сумма1 КАК Сумма1,
	//                      |	Таблица.Сумма2 КАК Сумма2,
	//                      |	Таблица.Сумма3 КАК Сумма3,
	//                      |	Таблица.Сумма4 КАК Сумма4,
	//                      |	Таблица.Сумма5 КАК Сумма5,
	//                      |	Таблица.СтатусИП КАК Статус
	//                      |ПОМЕСТИТЬ ТаблицаДвижений
	//                      |ИЗ
	//                      |	&Таблица КАК Таблица
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаДвижений.ID КАК ID,
	//                      |	1 КАК Предмет,
	//                      |	ТаблицаДвижений.Сумма1 КАК Сумма,
	//                      |	ТаблицаДвижений.Статус КАК Статус
	//                      |ПОМЕСТИТЬ ТаблицаЗадолженность
	//                      |ИЗ
	//                      |	ТаблицаДвижений КАК ТаблицаДвижений
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаДвижений.ID,
	//                      |	2,
	//                      |	ТаблицаДвижений.Сумма2,
	//                      |	ТаблицаДвижений.Статус
	//                      |ИЗ
	//                      |	ТаблицаДвижений КАК ТаблицаДвижений
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаДвижений.ID,
	//                      |	3,
	//                      |	ТаблицаДвижений.Сумма3,
	//                      |	ТаблицаДвижений.Статус
	//                      |ИЗ
	//                      |	ТаблицаДвижений КАК ТаблицаДвижений
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаДвижений.ID,
	//                      |	4,
	//                      |	ТаблицаДвижений.Сумма4,
	//                      |	ТаблицаДвижений.Статус
	//                      |ИЗ
	//                      |	ТаблицаДвижений КАК ТаблицаДвижений
	//                      |
	//                      |ОБЪЕДИНИТЬ ВСЕ
	//                      |
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаДвижений.ID,
	//                      |	5,
	//                      |	ТаблицаДвижений.Сумма5,
	//                      |	ТаблицаДвижений.Статус
	//                      |ИЗ
	//                      |	ТаблицаДвижений КАК ТаблицаДвижений
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	ТаблицаЗадолженность.ID КАК ID,
	//                      |	ТаблицаЗадолженность.Предмет КАК Предмет,
	//                      |	ТаблицаЗадолженность.Сумма - ЕСТЬNULL(ЗадолженностьПоИПОстатки.СуммаОстаток, 0) КАК Сумма,
	//                      |	ТаблицаЗадолженность.Статус КАК Статус
	//                      |ПОМЕСТИТЬ ДвиженияЗадолженность
	//                      |ИЗ
	//                      |	ТаблицаЗадолженность КАК ТаблицаЗадолженность
	//                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФССП_ЗадолженностьПоИП.Остатки(&МоментДО, ) КАК ЗадолженностьПоИПОстатки
	//                      |		ПО ТаблицаЗадолженность.ID = ЗадолженностьПоИПОстатки.ID
	//                      |			И ТаблицаЗадолженность.Предмет = ЗадолженностьПоИПОстатки.Предмет
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ
	//                      |	&Период КАК Период,
	//                      |	ВЫБОР
	//                      |		КОГДА ДвиженияЗадолженность.Сумма > 0
	//                      |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//                      |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	//                      |	КОНЕЦ КАК ВидДвижения,
	//                      |	ВЫБОР
	//                      |		КОГДА ДвиженияЗадолженность.Статус = &БезИсполнения
	//                      |			ТОГДА ИСТИНА
	//                      |		ИНАЧЕ ЛОЖЬ
	//                      |	КОНЕЦ КАК НеПлатеж,
	//                      |	ДвиженияЗадолженность.ID КАК ID,
	//                      |	ДвиженияЗадолженность.Предмет КАК Предмет,
	//                      |	ВЫБОР
	//                      |		КОГДА ДвиженияЗадолженность.Сумма > 0
	//                      |			ТОГДА ДвиженияЗадолженность.Сумма
	//                      |		ИНАЧЕ -ДвиженияЗадолженность.Сумма
	//                      |	КОНЕЦ КАК Сумма
	//                      |ИЗ
	//                      |	ДвиженияЗадолженность КАК ДвиженияЗадолженность
	//                      |ГДЕ
	//                      |	ДвиженияЗадолженность.Сумма <> 0");
	
	// КОГДА ДвиженияЗадолженность.Статус = Значение(Перечисление.ФССП_СтатусыИП.ОконченоБезИсполнения)
	
	//Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	//Запрос.УстановитьПараметр("МоментДо", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	//Запрос.УстановитьПараметр("Автор", ЭтотОбъект.Автор);
	//Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	//Запрос.УстановитьПараметр("Таблица", ТаблицаДвиженийИП);
	//Запрос.УстановитьПараметр("БезИсполнения",Перечисления.ФССП_СтатусыИП.ОконченоБезИсполнения);

	Конецпроцедуры
